<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Web Service Toolkit für PHP5 - Style Guide - Richtlinen zur Quellcode-Gestaltung</title>
<meta name="author" content="Stefan Marr" />
<link id="style" href="style.css" rel="stylesheet" rev="stylesheet" />
<script>
var phpOnly = false;
function switchCSS() {
  if (phpOnly) {
    document.getElementById('style').href = "style.css";
    document.getElementById('style_link').innerHTML = "nur Quellcode";
  }
  else {
    document.getElementById('style').href = "code.only.css";
    document.getElementById('style_link').innerHTML = "mit Hinweisen";
  }
  phpOnly = !phpOnly;
}
</script>
</head>

<body>
<h1>Style Guide</h1>
<a id="style_link" href="javascript:switchCSS();">nur Quellcode</a>
<h3>Richtlinien zur Quellcode-Gestaltung</h3>
<p>Diese Richtlinien dienen als Grundlage zur automatisierten Erstellung von Web Services aus PHP-Klassen. Dar&uuml;ber hinaus ist eine gute Dokumentation nat&uuml;rlich auch anzustreben, um die Wartbarkeit und Lesbarkeit der Quelltexte im gesamten Projekt zu erh&ouml;hen.</p>

<code class="completed">&lt;?php</code>
<code class="completed"> </code>

<h2>PHPDoc Kommentare</h2>
<p>Ein Dokumentationskommentar wird in HTML geschrieben und geh&ouml;rt vor Klassen, Attribute, Konstruktoren und Methoden. Er besteht aus zwei Teilen: einer Beschreibung und darauf folgenden PHPDoc-Tags, wie zum Beispiel @param, @return und @var. </p>

<p>Die erste Zeile beginnt dabei mit /** um den Anfang zu kennzeichnen. <br />
  Der erste Satz sollte eine kurze Zusammenfassung sein, darauf kann durch eine Leerzeile getrennt eine ausf&uuml;hrlichere Beschreibung folgen. Wieder durch eine Leerzeile getrennt, k&ouml;nnen anschlie&szlig;end weitere Angaben mit Hilfe der PHPDoc-Tags hinzugef&uuml;gt werden. Die letzte Zeile endet mit einem einfachen */ um den Kommentarblock zu schlie&szlig;en.</p>
<h2>PHPDoc Tags (Annotationen)</h2>
<p>
Folgende Annotationen müssen vorhanden sein, damit die erweiterte Reflection
API Typinformationen bereit stellen kann, um dann Web Services zu generieren.
</p>
<ul>
  <li><strong>@param</strong> datatype $paramname description<br />
  datatype kann einer der folgenden PHP-Typen sein
    <ul>
      <li>boolean</li>
      <li>integer</li>
      <li>float</li>
      <li>string</li>
      <li>array</li>
      <li>mixed</li>
      <li>void</li>
      <li>object</li>
      <li>beliebige Klasse </li>
    </ul>
    Au&szlig;erdem ist es m&ouml;glich Arrays von den PHP-Typen anzugeben. Dies 
    geschieht &uuml;ber ein Anh&auml;ngen von eckigen Klammern. Bsp.: integer[], 
    string[][]<br />
  Assoziative Arrays werden wie folgt notiert: array&lt;datatype,datatype&gt; wobei diese Notation nur verwendet werden sollte, wenn die Schl&uuml;ssel wirklich relevant sind, andernfalls ist die Notation mit eckigen Klammern vorzuziehen. Bsp.: array&lt;integer,string&gt; oder array&lt;string,MyClass&gt;
  <!-- New Notation:
   Assoziative Arrays werden wie folgt notiert: array(datatype=&gt;datatype) wobei diese Notation nur verwendet werden sollte, wenn die Schl&uuml;ssel wirklich relevant sind, andernfalls ist die Notation mit eckigen Klammern vorzuziehen. Bsp.: array(integer=&gt;string) oder array(string=&gt;MyClass)
  -->
  </li>
  <li><strong>@return</strong> datatype description<br />
  zur Angabe des R&uuml;ckgabewertes einer Methode oder Funktion.
  Wenn es keinen Rückgabewert gibt, sollte '@return void' angegeben werden.
  </li>
  <li><strong>@var</strong> datatype description<br />
    zur Dokumentation des Typs eines Attributs</li>
</ul>

<p>
Einige spezielle Annotationen werden von den InstantSVC-Werkzeugen beachtet
und ermöglichen bereits dem Programmierer, Klassen und Methoden für die
Veröffentlichung als Web Service zu markieren. Sie sind jedoch optional.
</p>
<ul>
  <li><strong>@webmethod</strong>/<strong>@restmethod</strong> und <strong>@webservice</strong><br />
    zur Kennzeichnung von Methoden, welche geeignet sind als Web Service angeboten 
    zu werden, siehe <a href="#webservices">Abschnitt Web Services</a> </li>
  <li><strong>@webserializable</strong><br />
  zur Kennzeichnung von Klassen, welche mittels eines Web Service &uuml;bertragen werden sollen</li>
</ul>
<p>
Zus&auml;tzlich können weitere Annotationen verwendet werden, um den Code noch
genauer zu dokumentieren.
</p>
<ul>
  <li><strong>@author</strong> authorname &lt;authoremail@example.com&gt;<br />
  Autor des mit diesem Tag versehenden Elements </li>
  <li><strong>@copyright</strong> info string <br />
    zur Angabe von Copyright-Hinweisen</li>
  <li><strong>@deprecated</strong> [info string]<br />
    im optionalen info string k&ouml;nnen Angaben bez&uuml;glich Version und Gr&uuml;nden hinterlegt werden
  </li>
  <li><strong>@global</strong> datatype $globalvariablename description<br />
    zum Dokumentieren von benutzten globalen Variablen</li>
  <li><strong>@internal</strong> info string<br />
    f&uuml;r Informationen die nur zum internen Gebrauch bestimmt sind</li>
  <li><strong>@license</strong> URL name of licence<br />
    zur Angabe der Lizenz unter der dieses Code-Fragment 
    ver&ouml;ffentlich wurde</li>
  <li><strong>@package</strong> name<br />
    zum Dokumentieren von strukturellen Zusammenh&auml;ngen</li>
  <li><strong>@see</strong> element<br />
    wird genutzt, um auf andere Elemente zu verweisen, z.B. Funktionen, Dateien, 
    Variable oder Klassen</li>
  <li><strong>@since</strong> info string<br />
    gibt an ab welcher Version dieses Element vorhanden ist</li>
  <li><strong>@todo</strong><br /> 
    zur Dokumentation von beabsichtigten &Auml;nderungen</li>
  <li><strong>@uses</strong> element<br />
    zur Dokumentation von Nutzungs-Beziehungen, z.B. von Konstanten oder Funktionen</li>
  <li><strong>@version</strong><br />
  zur Dokumentation der Version des betreffenden Elements</li>
</ul>
<h2>Klassen</h2>
<code>/**
 * Kurze Beschreibung dieser Klasse
 *
 * @webservice
 * @package    Paketname
 * @author     Max Mustermann &lt;mail@example.org&gt;
 * @copyright  2005 ....
 * @license    URL zur Lizenz   Name der Lizenz
 */
</code>
<code class="completed">class MyClass extends BaseClass {

</code>

<h2>Attribute</h2>
<p>Die Attribute, die in einer Klasse definiert werden, sind jeweils einzeln mit 
  einem PHPDoc Kommentar zu versehen. Dabei muss mindestens der Datentyp des Attributes 
  &uuml;ber den <strong>@var</strong>-Tag angegeben werden.</p>
<code>    /**
    * @var string
    */
    protected $name;

    /**
    * @var MyObject[]
    */
    private $objects = null;
</code>
<code class="completed"> </code>
<h2>Methoden und Funktionen</h2>
<p>Methoden und Funktionen m&uuml;ssen mit einem einleitenden PHPDoc Kommentar versehen werden.</p>
<p>Dabei sind <strong>@param</strong> und <strong>@return</strong> Pflichtangaben, 
  um f&uuml;r die Generierung der Web Services-Beschreibung Informationen &uuml;ber 
  die in der Signatur verwendeten Datentypen zu bekommen.</p>
<code>
    /**
    * Kurze Beschreibung
    *
    * Mehrzeilige, detailierte Beschreibung.
    * Hier können auch HTML-Tags zum Formatieren genutzt werden.
    * Darüber hinaus sind Kommentare in Englisch anzugeben.
    *
    * @param string $a
    * @param integer $b
    * @param MyClass $c
    * @return string[]
    * @webmethod
    */
    public function getMethod($a, $b, $c = null) { 
        return array('a', 'aa', 'b'); 
    }
</code>
<code class="completed">
}
</code>
<h2><a name="webservices"></a>Web Services</h2>
<p>Um Klassen und Methoden, welche als Web Service zur Verf&uuml;gung gestellt 
  werden sollen, m&ouml;glichst einfach von allen anderen Klassen unterscheiden 
  zu k&ouml;nnen, wurde zus&auml;tzlich die Annotation <strong>@webservice</strong> 
  eingef&uuml;hrt. Diese dient dazu, die Klasse sp&auml;ter &uuml;ber die Reflection 
  API als Web Service Klasse erkennen zu k&ouml;nnen. </p>
<p>Au&szlig;er der Klasse selbst k&ouml;nnen die anzubietenden Methoden ebenfalls speziell gekennzeichnet werden. Weitere Informationen dazu und <a href="webservices.html">allgemeine Hinweise zum Erstellen von Web Services</a> sind <a href="webservices.html">hier</a> zu finden. </p>
</body>
</html>
